---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.WoodColor1
source: html/233a75d7-b66b-aec8-79f1-3b1d603e8cae.htm
---
# Autodesk.Revit.DB.Visual.Wood.WoodColor1 Property

The property labeled "Color 1" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string WoodColor1 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.